#define CMD_LEN   4 // 4-char commands

#define Bit_0                    1 //0x0001
#define Bit_1                    2 //0x0002
#define Bit_2                    4 //0x0004
#define Bit_3                    8 //0x0008
#define Bit_4                   16 //0x0010
#define Bit_5                   32 //0x0020
#define Bit_6                   64 //0x0040
#define Bit_7                  128 //0x0080

#define Bit_8                  256 //0x0100
#define Bit_9                  512
#define Bit_10                1024
#define Bit_11                2048
#define Bit_12                4096
#define Bit_13                8192
#define Bit_14               16384
#define Bit_15               32768

#define Bit_16               65536
#define Bit_17              131072
#define Bit_18              262144
#define Bit_19              524288
#define Bit_20             1048576
#define Bit_21             2097152
#define Bit_22             4194304
#define Bit_23             8388608

#define Bit_24            16777216
#define Bit_25            33554432
#define Bit_26            67108864
#define Bit_27           134217728
#define Bit_28           268435456
#define Bit_29           536870912
#define Bit_30          1073741824
#define Bit_31          2147483648


//#define HOST_RX_BUFF_LEN				32		// Host Rx & LCD buff length
//#define HOST_TX_BUFF_LEN			128		// Host Tx buff length should be capable to output one terminal line 80 chars

#define adr_CHANNEL_TWO			167	// uint8    1     // channel 2 EEPROM address, channel one type i.e. bipolar or unipolar
#define adr_CHANNEL_THREE		168	// uint8    1     // channel 3 EEPROM address, channel one type i.e. bipolar or unipolar
#define adr_CHANNEL_FOUR		169	// uint8    1     // channel 4 EEPROM address, channel one type i.e. bipolar or unipolar
#define adr_CHANNEL_FIVE		170	// uint8    1     // channel 5 EEPROM address, channel one type i.e. bipolar or unipolar
#define adr_DLL_CONFIRM			171	// uint8    1     // dll confirm status
#define adr_BAUD_RATE			172	// uint16   2     // baud rate
#define adr_APP_STATUS			174	// uint8    1     // Modbus UART_parity
#define adr_DLL_NUM_OF_RETRIES	175	// uint8    1     // dll retries
#define adr_MONITOR_V_RANGE		176	// uint8    1     // BM Voltage Range (hardware - defined): if ((SysData.NV_UI.unit_type != 24) && (SysData.NV_UI.unit_type != 48) && (SysData.NV_UI.unit_type != 125) && (SysData.NV_UI.unit_type != 250)) SysData.NV_UI.unit_type = 125;
#define adr_V20H				177	//-!- FIX! 20 ma voltage point (V20) High byte
#define adr_true_1mA_false_20mA	191 // uint8    1     // NOT USED

#define adr_calrv5_low_meas		208	// float    4     three phase ripple voltage calibration
#define adr_calrv7_calptlow		212	// float    4
#define adr_calrv6_high_meas	216	// float    4
#define adr_calrv8_calpthigh	220	// float    4
#define adr_calri5_low_meas		224	// float    4     3 phase ripple current calibration
#define adr_calri7_calptlow		228	// float    4
#define adr_calri6_high_meas	232	// float    4
#define adr_calri8_calpthigh	236	// float    4

#define MAX_ADC_CHANNELS		8

/* IK20251030: IAR does not like structure name before {} - example below, Visual Studio C allows both
typedef struct Calibr2points         // this structure must be initialized, DO NOT CHANGE ORDER due to IAR bug, see LinInterpolation()
{
	float X1_lowADCcounts;     // lower 'Y1' coordinate, scaled ADC counts
	float Y1_lowCalibrVal;     // current or voltage - lower 'X1' coordinate, in 10th of mV or singles mA
	float X2_highADCcounts;    // higher 'Y2' coordinate, scaled ADC counts
	float Y2_highCalibrVal;    // current or voltage - higher 'X2' coordinate, in 10th of mV or singles mA
};

AIR accepts the below definition
*/
typedef struct          // this structure must be initialized, DO NOT CHANGE ORDER due to IAR bug, see LinInterpolation()
{
	float X1_lowADCcounts;		// lower 'X1' coordinate, ADC counts
	float Y1_lowCalibrVal;		// current or voltage - lower 'Y1' coordinate, in Volts or mA
	float X2_highADCcounts;		// higher 'X2' coordinate, ADC counts
	float Y2_highCalibrVal;		// current or voltage - higher 'Y2' coordinate, in Volts or mA
}Calibr2points;

#define X1_low_point			0	//index 1 of float[] array in union Calibration
#define Y1_low_point			1	//index 0 of float[] array in union Calibration
#define X2_high_point			2	//index 3 of float[] array in union Calibration
#define Y2_high_point			3	//index 2 of float[] array in union Calibration

typedef union          // this union is an alias of a structure, allows to acsess Calibr2points members as if they are in array of floats.
{
	float Coord[4];
	Calibr2points Cal;
} Calibration, *CalPtr;

typedef struct                      // this structure must be initialized, DO NOT CHANGE ORDER due to IAR bug, see LinInterpolation()
{
	float high_bat_threshold_V_f;	// 0x000 IK20251029 saved as float, menu changes value by 0.1 V increments/decrements
	float low_bat_threshold_V_f;	// 0x004 IK20251029 saved as float, menu changes value by 0.1 V increments/decrements
	float minus_gf_threshold_V_f;	// 0x008 IK20251029 saved as float, menu changes value by 0.1 V increments/decrements
	float plus_gf_threshold_V_f;	// 0x00C IK20251029 saved as float, menu changes value by 0.1 V increments/decrements
	float ripple_V_threshold_mV_f;	// 0x010 ripple voltage in mVolts, , menu changes value by 1 mV increments/decrements
	float ripple_I_threshold_mA_f;	// 0x014 ripple current in mAmperes, menu changes value by 1 mA increments/decrements
	float alarm_delay_sec_f;		// 0x018 grace period delay from event is triggered until alarm is set, menu changes value by 1 sec increments/decrements
	float baud_rate;				// 0x01C baud rate, default is Baud_19200. //IK20250826 included 115200, thus, need Uint32, menu changes value based on a list of possible baud rates
	float meter_address;			// 0x020 battery monitor address, menu changes value by 1 increment/decrement. If hold longer, changes by 10, even longer - by 100
	uint8  StartUpProtocol;			// 0x024 only valid values:    SETUP = 0x00,	DNP3 = 0x01,	MODBUS = 0x02,	ASCII_CMDS = 0x03,	ASCII_MENU = 0x04
	uint8  BRate_index;				// IK202601714 index of baud rate in Baud_Rates[] array, used to set SysData.NV_UI.baud_rate and Existing.baud_rate
	//uint8  UART_parity;				// 0x025 only valid values 0 = NONE; 1 = EVEN; 2 = ODD
	uint8  unit_type;				// 0x026 only valid values 24, 48, 125, 250
	uint8  unit_index;				// 0x027 corresponds to unit_type, range (0...3), used to access array Alarm_Limits[]
	uint16 host_address;			// 0x028 host address, not changed during operation
	uint16 disabled_alarms;			// 0x02A the bit == 1 disables a partcular alarm, Two bytes to include Last Gasp bit 8
	uint16 V4;						// 0x02C  4 mA voltage point (Voltage when current loop produces 4 mA or 0 mA)
	uint16 V20;						// 0x02E 20 ma voltage point (Voltage when current loop produces 20 mA or 1 mA)
	uint16 SavedStatusWord;			// 0x030 non-volatile user-chosen saved states as bits: buzzer on/off, latch on/off, 1 or 3 phase, current output I01 or I420
	//uint8  buzzer;				// REPLACED with bit in SavedStatusWord, indicates whether buzzer is on or off
	//uint8  phase;					// REPLACED with bit in SavedStatusWord, dealing with ripple created by battery charger type. =1 for single phase charger (120 Hz ripple), =3 for three phase charger (360 Hz ripple)
	//uint8  latch_state;			// REPLACED with bit in SavedStatusWord, whether or not latch on some event or when condition clears, restore normal operation
	//uint8  true_1mA_false_20mA;	// REPLACED with bit in SavedStatusWord, type of current output: 1 mA or 20 mA, used in CurrentOut_I420 calibration
}SettingsStruct;

// using pointer to Calibr2points to access members directly by name: float param = BatteryVolts.Y1_lowCalibrVal; param = BatteryVolts.Y2_highCalibrVal
// using pointer to Calibration to access members as array: float param = ((CalPtr)BatteryVolts)->Coord[1]; param = ((CalPtr)BatteryVolts->Coord[3];

typedef struct 	//size of SysData should be less, than 2048 - size of EEPROM block
{
									// adr    offset size
	uint16 Data_Valid;				// 0x000  2  // should not be FF
#define DATA_VALID_OFFSET       0
	uint16 FWversion;				// 0x002  2  // FW version, 0030
#define FW_VERSION_OFFSET       2
	uint16 dll_timeout;				// 0x004  2  //-!- IK20250203 only set/get not used in code !!  dll timeout
	uint16 inter_char_gap;			// 0x006  2  //-!- IK20250203 only set/get not used in code !!  inter-char gap, default = 1041 microseconds
	uint16 xmt_delay;				// 0x008  2  // xmt delay
	uint8 input_type[6];			// 0x00A  6  // type of analog input - uni-polar or bi-polar  index [0] is former variable 'analog_points'

	uint8 dll_confirm;				// 0x010  1  //-!- IK20250203 only set/get not used in code !!  dll confirm status
	uint8 app_confirm;				// 0x011  1  // Modbus UART_parity
	uint8 dll_retries;				// 0x012  1  //-!- IK20250203 only set/get not used in code !!  dll retries
	uint8 extra1_bytes[13];			// 0x015  11 // future use

	// LCD board settings start at 0x020
	uint8 FrontBoardBytes[16];		// 0x020  16  // future use

	// Calibration floats start at 0x030
	Calibr2points BatteryVolts;		// 0x030  16 // Y1 X1 Y2 X2 Battery Voltage calibration
	Calibr2points FaultVolts;		// 0x040  16 // Y1 X1 Y2 X2 Fault Voltage calibration
	Calibr2points MinusGndVolts;	// 0x050  16 // Y1 X1 Y2 X2 Minus Grnd voltage correction factor info
	Calibr2points RippleVolts1ph;	// 0x060  16 // Y1 X1 Y2 X2 single phase ripple voltage calibration
	Calibr2points RippleVolts3ph;	// 0x070  16 // Y1 X1 Y2 X2 three phase ripple voltage calibration
	Calibr2points RippleCurr1ph;	// 0x080  16 // Y1 X1 Y2 X2 single phase ripple current calibration
	Calibr2points RippleCurr3ph;	// 0x090  16 // Y1 X1 Y2 X2 three phase ripple current calibration
	Calibr2points CurrentOut_I420;	// 0x0A0  16 // NU X1 NU X2 current loop calibration, value in PWM register to get 4 mA or 20 mA
	SettingsStruct   NV_UI;			// 0x0B0 // Non Volatile User Interface settings controlled by user
	float Bat_Cal_Offset_Volts_f;	// 0x0C0  4 IK20251029 offset rarely changes, only by user from front panel CALibration menu. Typically, operator with sertified calibrated meter measures battery voltage and adjusts offset to match displayed voltage to his meter.
#define EXTRA_FLOATS_NUM			4
	float extra_floats[EXTRA_FLOATS_NUM];	// 0x0C4  4*EXTRA_FLOATS_NUM  // future use
	//--- if EXTRA_FLOATS_NUM = 7 next address is  0x0E0
}SYS_SPECIFIC_DATA;
extern SYS_SPECIFIC_DATA SysData; //IK20250620 defined in main.c

#ifdef PC
extern  SYS_SPECIFIC_DATA DefaultSysdata;
extern SYS_SPECIFIC_DATA EEPROM_SysData;
#else //ATMEL
extern __no_init SYS_SPECIFIC_DATA DefaultSysdata;
extern __eeprom  SYS_SPECIFIC_DATA EEPROM_SysData;// located in EEPROM @ EE_SYS_DATA_OFFSET, @ 0x100
#endif// PC


#define NUM_ALARMS   9  // Current number of alarms defined

//********** rt.OperStatusWord definitions
#define Alarm_BatVoltageHIGH_BitNum     0	// Battery Voltage High, above Vmax setting
#define Alarm_BatVoltageLOW_BitNum      1	// Battery Voltage LOW, below Vmin setting
#define Alarm_PlusGND_FAULT_BitNum      2	// Ground Voltage High, above V_GND_Plus setting
#define Alarm_MinusGND_FAULT_BitNum     3	// Ground Voltage LOW, below V_GND_Minus setting
